[{"Title":"Version 1.4.3 of Apple TV App Released","Link":"https://emby.media/community/index.php?/blog/1/entry-478-version-143-of-apple-tv-app-released/","Description":"A new version of our Apple TV app is rolling out now. Your device should upgrade automatically. This version cleans up a few things and lays the groundwork for the next release which should have some long-awaited improvements. In this release:&nbsp;New Features / Improvements:Rebuilt the startup / login flow to better align with the other Emby applications. This should significantly improve the reliability of the startup / sign in process.Apple TV Top Shelf Improvements:Top Shelf is now updated when the app enters the foreground or when playback stops.Top Shelf sections have been updated to align with the other Emby applications (Continue Watching, Next Up, Latest Movies)Top Shelf images now match that of other Emby applications&nbsp;&nbsp;&nbsp;Home screen now dynamically adds the Continue Watching section when appropriateMovie Suggestions screen now dynamically adds the Continue Watching section when appropriateShows Suggestions screen now dynamically adds the Continue Watching section when appropriate&nbsp;Improved internationalization support on most screens. This includes significantly more languages as well as improving consistency in naming where possible.&nbsp;Bug Fixes:Fixed an issue where backdrop images weren't included in the Continue Watching section of the home screen of the appThe app will no longer make requests for images that don't exist. This would cause server logs to be polluted with errorsMovie images for the Continue Watching section on the home screen have been correctedFixed an issue where a loader would display when backing out of music playbackFixed a bug that prevented the Person Detail from displaying in newer server versions","DescriptionHtml":"<p>A new version of our Apple TV app is rolling out now. Your device should upgrade automatically. This version cleans up a few things and lays the groundwork for the next release which should have some long-awaited improvements. In this release:</p><p>&nbsp;</p><p><span  style='font-size: 18px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><strong class='bbc'>New Features / Improvements:</strong></span></span></span><ul class='bbc'><li>Rebuilt the startup / login flow to better align with the other Emby applications. This should significantly improve the reliability of the startup / sign in process.</li><li>Apple TV Top Shelf Improvements:</li><li>Top Shelf is now updated when the app enters the foreground or when playback stops.</li><li>Top Shelf sections have been updated to align with the other Emby applications (Continue Watching, Next Up, Latest Movies)</li><li>Top Shelf images now match that of other Emby applications</li></ul></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5de85321a9c6a_SimulatorScreenShotAppleTV4Kat1080p20191204at194319.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5de8532f8d447_SimulatorScreenShotAppleTV4Kat1080p20191204at194326.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><ul class='bbc'><li>Home screen now dynamically adds the Continue Watching section when appropriate</li><li>Movie Suggestions screen now dynamically adds the Continue Watching section when appropriate</li><li>Shows Suggestions screen now dynamically adds the Continue Watching section when appropriate</li></ul></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5de85456b47b7_SimulatorScreenShotAppleTV4Kat1080p20191204at194611.png' alt='Posted Image'  /></span></span></span><br /><ul class='bbc'><li>Improved internationalization support on most screens. This includes significantly more languages as well as improving consistency in naming where possible.</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 18px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><strong class='bbc'>Bug Fixes:</strong></span></span></span><ul class='bbc'><li>Fixed an issue where backdrop images weren't included in the Continue Watching section of the home screen of the app</li><li>The app will no longer make requests for images that don't exist. This would cause server logs to be polluted with errors</li><li>Movie images for the Continue Watching section on the home screen have been corrected</li><li>Fixed an issue where a loader would display when backing out of music playback</li><li>Fixed a bug that prevented the Person Detail from displaying in newer server versions</li></ul></p>","Date":"2019-12-05T12:50:22.0000000Z"},{"Title":"Emby Server 4.3 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-477-emby-server-43-released/","Description":"Emby Server 4.3 is currently rolling out. Here are the highlights.&nbsp;New Video OSD&nbsp;The new design features big buttons and big graphics, making it easier and more fun to use.&nbsp;&nbsp;&nbsp;New Audio OSDSimilar to the new Video OSD design, with different variations based on the type of screen you're playing from.&nbsp;&nbsp;New Remote Control OSD&nbsp;The updated design now shares many of the same features as the video OSD:Big buttonsSupport for thumbnails while seekingAs well as:Clickable links - album, artist, series, etc.Favorite icon to mark now playing media as a favorite3-dot button to manipulate the now playing library item&nbsp;&nbsp;Convert to HEVC&nbsp;Our media conversion feature now supports converting to HEVC !&nbsp;&nbsp;Conversion Queue Management&nbsp;This is now a separate section in the server dashboard, and as a result should be much easier to find and use.&nbsp;&nbsp;Simultaneous Video Stream Limits&nbsp;This is configurable both system wide as a total limit, as well as individual user limits.&nbsp;&nbsp;New Screen Saver Options&nbsp;The Emby web app now includes three screen saver options for Emby Premiere users.Emby logo screen saverBackdrop screen saverPhoto screen saverThis is a great way to put your family photos on the screen when you're idling.&nbsp;&nbsp;Included In&nbsp;Now you can see what Playlists or Collections a Movie has been added to right from the Movie detail screen.&nbsp;&nbsp;Are You Still Watching?&nbsp;Now in the web app, and configurable at the bottom of the playback settings screen.&nbsp;&nbsp;Other ImprovementsUpdate to ffmpeg 4.3Build Windows & MacOS with .NET Core 3.0Utilize ReadyToRun feature with .NET Core 3.0 for faster startup timeSupport TLS 1.3 with .NET Core 3.0Add web app splash screen to provide user feedback in case of long loading timesExpand media conversion feature to allow selection of containers, video codecs, and audio codecsImprove video start time when resumingAllow plugins to have translation filesRestore counts on list screensAdjust live stream automatic re-connectionImprove handling of UTF-8 null chars in ass/ssa subsScrolling fixes for older versions of FirefoxMove up subtitles in ChromeImprove browser rendering of ASS/SSA subtitlesAdd Collections to search resultsMove Bluray folder support to pluginSupport .pef imagesImprove detection of HEVC REXT profilesImprove MacOS file deletionRead artist tags from videosAdded Swiss parental ratingsImprove support for filenames starting with bracketsAdd filters for missing external Id'sImprove transcoding reason display after direct play errorReduce dlna and scheduled task logging to prevent keeping Synology systems awakeSupport aspect ratio adjustment in web app video playerHandle urls with double encoding caused by old Dlna devicesDisplay Chinese subtitles display language as just ChineseReduce excess loggingImprove Android Server native UIAllow multiple libraries using the same nameBug FixesVAAPI: Fix data twist in HEVC profile mapDXVA: Fix 10bit profile detectionFix detection of DirectX 11.1 availabilityFix QSV DirectX initializationFix Failed to create Direct3D device Error creating a QSV deviceFix embyserver.exe file icon for WindowsFix mpeg4/divx/xvid transcoding with Android serverFix GPU to CPU automatic fallback when transcoding to ChromecastVarious Subtitle transcoding fixesFix very rare hang when recording Live TVFix download transcoding of audio files with embedded imagesFix subtitle file names with convert featureFix occasional hangs in media conversion featureFix sync features using path substitution when it should not beFix multi-version grouping in mixed content librariesFix display of quote characters in device namesFix ServerWMC recording playbackAdd additional image processing error handlingFix playlists folder always showing up for brand new server installationsFix collections not generating an image when lockedFix delete error response codesFix delete recordings from live tv pluginsFix now playing bar transparency on dark green and dark red themesFix occasional live tv or recording server crashFix user data restore with backup pluginFix scroll position after editing images or metadataFix saving playlist xml when playlist names end with a periodFix repeated scanning of external subtitlesFix latest trailers sort orderFix season counts being incorrect with multi-folder seriesFix audio stream copy with multiple audio streamsFix date last episode added sorting to not be affected by dates of seasonsFix error in ffmpeg filter string when burning in subtitlesFix manual ungrouping of merged episodesFix extras with multi-version videosFix updating user images not immediately reflectingFix renaming library requiring full library scan","DescriptionHtml":"<p>Emby Server 4.3 is currently rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Video OSD</span></p><p>&nbsp;</p><p>The new design features big buttons and big graphics, making it easier and more fun to use.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d6ec7fd87376_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d72b49d112ea_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Audio OSD</span><br />Similar to the new Video OSD design, with different variations based on the type of screen you're playing from.<br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db89f20ab9ba_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5dabfa9f4d6c4_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Remote Control OSD</span></p><p>&nbsp;</p><p>The updated design now shares many of the same features as the video OSD:<ul class='bbc'><li>Big buttons</li><li>Support for thumbnails while seeking</li></ul>As well as:<ul class='bbc'><li>Clickable links - album, artist, series, etc.</li><li>Favorite icon to mark now playing media as a favorite</li><li>3-dot button to manipulate the now playing library item</li></ul></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d9e3eab91597_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Convert to HEVC</span></p><p>&nbsp;</p><p>Our media conversion feature now supports converting to HEVC !</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d965e9bc6118_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Conversion Queue Management</span></p><p>&nbsp;</p><p>This is now a separate section in the server dashboard, and as a result should be much easier to find and use.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5ddda0138091b_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Simultaneous Video Stream Limits</span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>This is configurable both system wide as a total limit, as well as individual user limits.</span></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d850d4e1bca3_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Screen Saver Options</span></p><p>&nbsp;</p><p>The Emby web app now includes three screen saver options for Emby Premiere users.<ul class='bbc'><li>Emby logo screen saver</li><li>Backdrop screen saver</li><li>Photo screen saver</li></ul>This is a great way to put your family photos on the screen when you're idling.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5dcc553d14b0e_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Included In</span></p><p>&nbsp;</p><p>Now you can see what Playlists or Collections a Movie has been added to right from the Movie detail screen.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d8e394126546_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Are You Still Watching?</span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Now in the web app, and configurable at the bottom of the playback settings screen.</span></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d850b6403fe8_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Update to ffmpeg 4.3</li><li>Build Windows & MacOS with .NET Core 3.0</li><li>Utilize ReadyToRun feature with .NET Core 3.0 for faster startup time</li><li>Support TLS 1.3 with .NET Core 3.0</li><li>Add web app splash screen to provide user feedback in case of long loading times</li><li>Expand media conversion feature to allow selection of containers, video codecs, and audio codecs</li><li>Improve video start time when resuming</li><li>Allow plugins to have translation files</li><li>Restore counts on list screens</li><li>Adjust live stream automatic re-connection</li><li>Improve handling of UTF-8 null chars in ass/ssa subs</li><li>Scrolling fixes for older versions of Firefox</li><li>Move up subtitles in Chrome</li><li>Improve browser rendering of ASS/SSA subtitles</li><li>Add Collections to search results</li><li>Move Bluray folder support to plugin</li><li>Support .pef images</li><li>Improve detection of HEVC REXT profiles</li><li>Improve MacOS file deletion</li><li>Read artist tags from videos</li><li>Added Swiss parental ratings</li><li>Improve support for filenames starting with brackets</li><li>Add filters for missing external Id's</li><li>Improve transcoding reason display after direct play error</li><li>Reduce dlna and scheduled task logging to prevent keeping Synology systems awake</li><li>Support aspect ratio adjustment in web app video player</li><li>Handle urls with double encoding caused by old Dlna devices</li><li>Display Chinese subtitles display language as just Chinese</li><li>Reduce excess logging</li><li>Improve Android Server native UI</li><li>Allow multiple libraries using the same name</li></ul><span  style='font-size: 24px'>Bug Fixes</span><ul class='bbc'><li>VAAPI: Fix data twist in HEVC profile map</li><li>DXVA: Fix 10bit profile detection</li><li>Fix detection of DirectX 11.1 availability</li><li>Fix QSV DirectX initialization</li><li>Fix Failed to create Direct3D device Error creating a QSV device</li><li>Fix embyserver.exe file icon for Windows</li><li>Fix mpeg4/divx/xvid transcoding with Android server</li><li>Fix GPU to CPU automatic fallback when transcoding to Chromecast</li><li>Various Subtitle transcoding fixes</li><li>Fix very rare hang when recording Live TV</li><li>Fix download transcoding of audio files with embedded images</li><li>Fix subtitle file names with convert feature</li><li>Fix occasional hangs in media conversion feature</li><li>Fix sync features using path substitution when it should not be</li><li>Fix multi-version grouping in mixed content libraries</li><li>Fix display of quote characters in device names</li><li>Fix ServerWMC recording playback</li><li>Add additional image processing error handling</li><li>Fix playlists folder always showing up for brand new server installations</li><li>Fix collections not generating an image when locked</li><li>Fix delete error response codes</li><li>Fix delete recordings from live tv plugins</li><li>Fix now playing bar transparency on dark green and dark red themes</li><li>Fix occasional live tv or recording server crash</li><li>Fix user data restore with backup plugin</li><li>Fix scroll position after editing images or metadata</li><li>Fix saving playlist xml when playlist names end with a period</li><li>Fix repeated scanning of external subtitles</li><li>Fix latest trailers sort order</li><li>Fix season counts being incorrect with multi-folder series</li><li>Fix audio stream copy with multiple audio streams</li><li>Fix date last episode added sorting to not be affected by dates of seasons</li><li>Fix error in ffmpeg filter string when burning in subtitles</li><li>Fix manual ungrouping of merged episodes</li><li>Fix extras with multi-version videos</li><li>Fix updating user images not immediately reflecting</li><li>Fix renaming library requiring full library scan</li></ul></p>","Date":"2019-11-26T20:39:00.0000000Z"},{"Title":"Emby for iOS Updated with Camera Upload Feature","Link":"https://emby.media/community/index.php?/blog/1/entry-476-emby-for-ios-updated-with-camera-upload-feature/","Description":"Emby for iOS 1.8.7 has been released. Here are the highlights:&nbsp;\nUpload Photos and Videos To Your Emby Server&nbsp;\nWith Camera Upload and Emby Premiere, you can automatically upload photos and videos to your Emby Server, just by enabling it in the iOS app settings.&nbsp;\n&nbsp;\nIf you'd like to configure where the photos and videos get uploaded to on your server, you can do this in the Camera Upload section of the Emby Server dashboard:&nbsp;\n&nbsp;\nEnjoy uploading your photos and videos !","DescriptionHtml":"<p>Emby for iOS 1.8.7 has been released. Here are the highlights:</p><p>&nbsp;</p><p>\n<span  style='font-size: 24px'>Upload Photos and Videos To Your Emby Server</span></p><p>&nbsp;</p><p>\nWith Camera Upload and <a href='https://emby.media/premiere' class='bbc_url' title=''>Emby Premiere</a>, you can automatically upload photos and videos to your Emby Server, just by enabling it in the iOS app settings.</p><p>&nbsp;</p><p>\n<span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5dd581fd3ea6c_Screenshot_20191120130953.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>\nIf you'd like to configure where the photos and videos get uploaded to on your server, you can do this in the Camera Upload section of the Emby Server dashboard:</p><p>&nbsp;</p><p>\n<span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5dd5823fcc0e4_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>\nEnjoy uploading your photos and videos !</p>","Date":"2019-11-20T17:49:00.0000000Z"},{"Title":"Emby for LG Smart TVs 1.0.20 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-475-emby-for-lg-smart-tvs-1020-released/","Description":"A new release of Emby for LG is currently rolling out. Here are the highlights:Resolve ass/ssa subtitle crash on WebOS 4.0 +Various bug fixes within the video OSD","DescriptionHtml":"<p>A new release of Emby for LG is currently rolling out. Here are the highlights:<ul class='bbc'><li>Resolve ass/ssa subtitle crash on WebOS 4.0 +</li><li>Various bug fixes within the video OSD</li></ul><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db34169e11ba_Untitled.png' alt='Posted Image'  /></span></p>","Date":"2019-11-19T15:20:00.0000000Z"},{"Title":"Manage your Home with Emby Users","Link":"https://emby.media/community/index.php?/blog/1/entry-177-manage-your-home-with-emby-users/","Description":"Team,Today, we're going to show you how you can be the master of your domain with Emby Users. Why create separate user accounts for each member of your household? Because users can have their own personalized media libraries, user data, recommendations, parental controls, security settings, and more.  Users are managed by opening the server dashboard and navigating to Users.UsersUsers are generally intended to be people who don't already have an online Emby Connect account. This is where most people will add the members of their household:A user will be displayed with a cloud if they're linked to Emby Connect. Why link to Emby Connect? Connect allows easy sign in away from home, where nothing more is needed than a username and password.GuestsGuests are fundamentally the same as Users, but they provide an easy way to invite someone who already has an Emby Connect account. This will easily import their display name and image into your server.Feature AccessTo manage user feature access, start by visiting the Users page and clicking on a user account. Features can easily be granted or denied, such as the ability to sync media, view live tv, manage live tv, etc. The \"Allow media playback\" option determines if the user is able to play media or not. This option is handy if you'd like to setup a guest user who can browse the library but not play anything.Content AccessContent access allows you to configure the libraries a user is allowed to access.Channel access also provides the same ability to control what your users can view and what they can't:Device AccessDevice access allows you to configure the devices a user is allowed to sign in from. By default, users can use any device.Parental Controls by RatingEasily block content from users based on their official rating:But sometimes it's also handy to control blocking of unrated content:Parental Controls by TagsContent can also be restricted based on the presence of tags:Tags are treated recursively, meaning you can easily block an entire TV series just adding a tag at the series level.Parental Controls by Access SchedulingEasily block access during certain hours by creating access schedules. Now you'll never have to worry about your kids streaming videos during their biology lectures.Advanced ControlsNeed to quickly disable user accounts? Would you like to hide certain accounts from app login screens? Easily do that with advanced controls.You can even take away a user's ability to edit their own profile settings. Maybe you don't want your kids accidentally changing their preferred subtitle language. Or maybe you have all your kids on one shared kids account and you'd like to manage the profile preferences yourself.PasswordsEasily create passwords to keep your accounts secure and safe.But we all know that passwords can be cumbersome in the living room, so that's why we offer an Easy Pin Code feature for in-home use:Activity LogFollow what your users are doing. Just about everything appears in the activity log, from signing in to signing out, playing or pausing content, changing passwords, settings, and more.See What They're Watching, in Real-timeThe server dashboard also gives you real-time access to monitor what your users are currently watching.Easy Remote ControlNeed to quickly remote control a user's app? This is easily done with the remote control functions built into the web interface. Stop, pause, rewind, change audio, subtitles, and more with the tap of a finger.The over-sized buttons make them very easy to tap on a smartphone or tablet, which makes it quite fun to flick through the scene selection menu:You can even send directional input just like a real remote:We hope this gives you a little more information on what Emby Users can do. If you still have your whole family on one shared account, try creating user profiles. We think you'll enjoy them","DescriptionHtml":"Team,<br /><br />Today, we're going to show you how you can be the master of your domain with Emby Users. Why create separate user accounts for each member of your household? Because users can have their own personalized media libraries, user data, recommendations, parental controls, security settings, and more. <strong class='bbc'> </strong>Users are managed by opening the server dashboard and navigating to <strong class='bbc'>Users</strong>.<br /><br /><span  style='font-size: 24px'>Users</span><br /><br />Users are generally intended to be people who don't already have an online Emby Connect account. This is where most people will add the members of their household:<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://raw.githubusercontent.com/wiki/MediaBrowser/Wiki/images/server/users1.png' alt='Posted Image'  /></span><br /><br /><br />A user will be displayed with a cloud if they're linked to <a href='https://github.com/MediaBrowser/Wiki/wiki/Media%20Browser%20Connect' class='bbc_url' title='External link' rel='nofollow external'>Emby Connect</a>. Why link to Emby Connect? Connect allows easy sign in away from home, where nothing more is needed than a username and password.<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://raw.githubusercontent.com/wiki/MediaBrowser/Wiki/images/server/users6.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Guests</span><br /><br />Guests are fundamentally the same as Users, but they provide an easy way to invite someone who already has an <a href='https://github.com/MediaBrowser/Wiki/wiki/Media%20Browser%20Connect' class='bbc_url' title='External link' rel='nofollow external'>Emby Connect</a> account. This will easily import their display name and image into your server.<br /><br /><span  style='font-size: 24px'>Feature Access</span><br /><br />To manage user feature access, start by visiting the Users page and clicking on a user account. Features can easily be granted or denied, such as the ability to sync media, view live tv, manage live tv, etc. The \"Allow media playback\" option determines if the user is able to play media or not. This option is handy if you'd like to setup a guest user who can browse the library but not play anything.<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users21.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Content Access</span><br /><br />Content access allows you to configure the libraries a user is allowed to access.<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users23.png' alt='Posted Image'  /></span><br /><br /><br />Channel access also provides the same ability to control what your users can view and what they can't:<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users24.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Device Access</span><br /><br />Device access allows you to configure the devices a user is allowed to sign in from. By default, users can use any device.<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users17.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Parental Controls by Rating</span><br /><br />Easily block content from users based on their official rating:<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users13.png' alt='Posted Image'  /></span><br /><br /><br />But sometimes it's also handy to control blocking of unrated content:<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users14.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Parental Controls by Tags</span><br /><br />Content can also be restricted based on the presence of tags:<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users15.png' alt='Posted Image'  /></span><br /><br />Tags are treated recursively, meaning you can easily block an entire TV series just adding a tag at the series level.<br /><br /><span  style='font-size: 24px'>Parental Controls by Access Scheduling</span><br /><br />Easily block access during certain hours by creating access schedules. Now you'll never have to worry about your kids streaming videos during their biology lectures.<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users16.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Advanced Controls</span><br /><br />Need to quickly disable user accounts? Would you like to hide certain accounts from app login screens? Easily do that with advanced controls.<br /><br />You can even take away a user's ability to edit their own profile settings. Maybe you don't want your kids accidentally changing their preferred subtitle language. Or maybe you have all your kids on one shared kids account and you'd like to manage the profile preferences yourself.<br /><br /><span rel='lightbox'><img class='bbc_img' src='https://github.com/MediaBrowser/Wiki/wiki/images/server/users20.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Passwords</span><br /><br />Easily create passwords to keep your accounts secure and safe.<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54f9fc46f186e_pw1.png' alt='Posted Image'  /></span><br /><br />But we all know that passwords can be cumbersome in the living room, so that's why we offer an Easy Pin Code feature for in-home use:<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54f9fca783406_pw2.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Activity Log</span><br /><br />Follow what your users are doing. Just about everything appears in the activity log, from signing in to signing out, playing or pausing content, changing passwords, settings, and more.<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54f9ff453e03c_rm3.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>See What They're Watching, in Real-time</span><br /><br />The server dashboard also gives you real-time access to monitor what your users are currently watching.<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54f9ffb238504_rm1.png' alt='Posted Image'  /></span><br /><br /><span  style='font-size: 24px'>Easy Remote Control</span><br /><br />Need to quickly remote control a user's app? This is easily done with the remote control functions built into the web interface. Stop, pause, rewind, change audio, subtitles, and more with the tap of a finger.<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54fa0005935f3_rm2.png' alt='Posted Image'  /></span><br /><br />The over-sized buttons make them very easy to tap on a smartphone or tablet, which makes it quite fun to flick through the scene selection menu:<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54fa037039211_rm5.png' alt='Posted Image'  /></span><br /><br /><br />You can even send directional input just like a real remote:<br /><br /><span rel='lightbox'><img class='bbc_img' src='http://mediabrowser.tv/community/uploads/inline/2/54fa007ce1d12_rm4.png' alt='Posted Image'  /></span><br /><br />We hope this gives you a little more information on what Emby Users can do. If you still have your whole family on one shared account, try creating user profiles. We think you'll enjoy them <img src='https://emby.media/community/public/style_emoticons/default/smile.png' class='bbc_emoticon' alt=':)' />","Date":"2019-11-12T20:35:11.0000000Z"},{"Title":"Emby for LG Smart TVs 1.0.19 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-474-emby-for-lg-smart-tvs-1019-released/","Description":"A new release of Emby for LG is currently rolling out. Here are the highlights:&nbsp;New Video OSD&nbsp;The new on-screen display provides a cleaner design while still giving you access to the most important information and controls.&nbsp;&nbsp;Other ImprovementsVarious subtitle fixes for WebOS 1 & WebOS 2 devicesAdd \"Are you still watching?\" feature","DescriptionHtml":"<p>A new release of Emby for LG is currently rolling out. Here are the highlights:</p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Video OSD</span></p><p>&nbsp;</p><p>The new on-screen display provides a cleaner design while still giving you access to the most important information and controls.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db34169e11ba_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Various subtitle fixes for WebOS 1 & WebOS 2 devices</li><li>Add \"Are you still watching?\" feature</li></ul></p>","Date":"2019-10-25T18:34:00.0000000Z"},{"Title":"Emby for iOS Updated with New Audio and Remote Control OSD","Link":"https://emby.media/community/index.php?/blog/1/entry-473-emby-for-ios-updated-with-new-audio-and-remote-control-osd/","Description":"Emby for iOS 1.8.5 has been released. Here are the highlights:New audio OSDNew remote control OSDImprove video OSD&nbsp;&nbsp;","DescriptionHtml":"<p>Emby for iOS 1.8.5 has been released. Here are the highlights:<ul class='bbc'><li>New audio OSD</li><li>New remote control OSD</li><li>Improve video OSD</li></ul><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db1e31bb1d34_Screenshot_20191024125220.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db1e325c218f_Screenshot_20191024125230.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5db1e32f1ece3_Screenshot_20191024125314.png' alt='Posted Image'  /></span></p>","Date":"2019-10-24T17:42:00.0000000Z"},{"Title":"Emby for iOS Updated for iOS 13 and New Video OSD","Link":"https://emby.media/community/index.php?/blog/1/entry-472-emby-for-ios-updated-for-ios-13-and-new-video-osd/","Description":"Emby for iOS 1.8.3 has been released and includes compatibility updates for iOS 13. Here are some other highlights:Collections now shown in search resultsNew Video OSD&nbsp;You asked for bigger buttons that are easier to tap, and now you have them. Additionally the entire presentation has been cleaned up in order to make it as easy and intuitive as possible.&nbsp;","DescriptionHtml":"<p>Emby for iOS 1.8.3 has been released and includes compatibility updates for iOS 13. Here are some other highlights:<br /><ul class='bbc'><li>Collections now shown in search results</li></ul><span  style='font-size: 24px'>New Video OSD</span></p><p>&nbsp;</p><p>You asked for bigger buttons that are easier to tap, and now you have them. Additionally the entire presentation has been cleaned up in order to make it as easy and intuitive as possible.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d8135784cedb_Screenshot_20190917151120.png' alt='Posted Image'  /></span></p>","Date":"2019-09-17T19:33:00.0000000Z"},{"Title":"Emby for Android Mobile Updated with Improved Downloading","Link":"https://emby.media/community/index.php?/blog/1/entry-471-emby-for-android-mobile-updated-with-improved-downloading/","Description":"Emby for Android 3.0.73 is rolling out and contains a number of important fixes and improvements. Here are the highlights:Fixed downloading to external SD cardsImproved download reliabilityImproved reliability of camera upload featureFixed audio/video sync for certain videos","DescriptionHtml":"<p>Emby for Android 3.0.73 is rolling out and contains a number of important fixes and improvements. Here are the highlights:<ul class='bbc'><li>Fixed downloading to external SD cards</li><li>Improved download reliability</li><li>Improved reliability of camera upload feature</li><li>Fixed audio/video sync for certain videos</li></ul><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d657cb22ef33_Screenshot_20190827145354.png' alt='Posted Image'  /></span></p>","Date":"2019-08-27T18:34:00.0000000Z"},{"Title":"Emby for LG Smart TVs 1.0.18 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-470-emby-for-lg-smart-tvs-1018-released/","Description":"A new release of Emby for LG is currently rolling out. Here are the highlights:&nbsp;New Detail Screen Button Design&nbsp;A new and improved detail screen design matches our layout in other Emby apps and makes the most important features easier to find.&nbsp;&nbsp;Other HighlightsImproved subtitle playbackImprove sorting and filtering to match capabilities of other Emby appsImprove navigation performanceTags now displayed on detail screens&nbsp;","DescriptionHtml":"<p>A new release of Emby for LG is currently rolling out. Here are the highlights:</p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Detail Screen Button Design</span></p><p>&nbsp;</p><p>A new and improved detail screen design matches our layout in other Emby apps and makes the most important features easier to find.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5d5c4bcda3582_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Highlights</span><ul class='bbc'><li>Improved subtitle playback</li><li>Improve sorting and filtering to match capabilities of other Emby apps</li><li>Improve navigation performance</li><li>Tags now displayed on detail screens</li></ul></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5ab414b4a28a1_Untitled.png' alt='Posted Image'  /></span></p>","Date":"2019-08-20T19:34:00.0000000Z"}]